Autodesk.Revit.DB.Structure.LoadUsage.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new LoadUsage.
document:
The Document to which new load usage element will be added.
name:
The name of the load usage.
Returns:
The newly created load usage element if successful, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given name is not unique
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016